[
  {
    "name": "University of Alberta",
    "city": "Edmonton",
    "province": "Alberta",
    "country": "Canada",
    "students": 40000,
    "founded": 1908,
    "description": "University of Alberta is a well-established post-secondary institution located in Edmonton, Alberta. Since its founding in 1908, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 40000, University of Alberta is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.ualberta.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.ualberta.ca"
  },
  {
    "name": "University of Calgary",
    "city": "Calgary",
    "province": "Alberta",
    "country": "Canada",
    "students": 35000,
    "founded": 1966,
    "description": "University of Calgary is a well-established post-secondary institution located in Calgary, Alberta. Since its founding in 1966, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 35000, University of Calgary is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.ucalgary.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.ucalgary.ca"
  },
  {
    "name": "University of Lethbridge",
    "city": "Lethbridge",
    "province": "Alberta",
    "country": "Canada",
    "students": 8500,
    "founded": 1967,
    "description": "University of Lethbridge is a well-established post-secondary institution located in Lethbridge, Alberta. Since its founding in 1967, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 8500, University of Lethbridge is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.ulethbridge.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.ulethbridge.ca"
  },
  {
    "name": "Athabasca University",
    "city": "Athabasca",
    "province": "Alberta",
    "country": "Canada",
    "students": 40000,
    "founded": 1970,
    "description": "Athabasca University is a well-established post-secondary institution located in Athabasca, Alberta. Since its founding in 1970, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 40000, Athabasca University is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.athabascau.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.athabascau.ca"
  },
  {
    "name": "MacEwan University",
    "city": "Edmonton",
    "province": "Alberta",
    "country": "Canada",
    "students": 19000,
    "founded": 1971,
    "description": "MacEwan University is a well-established post-secondary institution located in Edmonton, Alberta. Since its founding in 1971, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 19000, MacEwan University is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.macewan.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.macewan.ca"
  },
  {
    "name": "Mount Royal University",
    "city": "Calgary",
    "province": "Alberta",
    "country": "Canada",
    "students": 14000,
    "founded": 1910,
    "description": "Mount Royal University is a well-established post-secondary institution located in Calgary, Alberta. Since its founding in 1910, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 14000, Mount Royal University is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.mtroyal.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.mtroyal.ca"
  },
  {
    "name": "Alberta University of the Arts",
    "city": "Calgary",
    "province": "Alberta",
    "country": "Canada",
    "students": 1200,
    "founded": 1926,
    "description": "Alberta University of the Arts is a well-established post-secondary institution located in Calgary, Alberta. Since its founding in 1926, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 1200, Alberta University of the Arts is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.auarts.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.auarts.ca"
  },
  {
    "name": "Concordia University of Edmonton",
    "city": "Edmonton",
    "province": "Alberta",
    "country": "Canada",
    "students": 2300,
    "founded": 1921,
    "description": "Concordia University of Edmonton is a well-established post-secondary institution located in Edmonton, Alberta. Since its founding in 1921, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 2300, Concordia University of Edmonton is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.concordia.ab.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.concordia.ab.ca"
  },
  {
    "name": "The King's University",
    "city": "Edmonton",
    "province": "Alberta",
    "country": "Canada",
    "students": 900,
    "founded": 1979,
    "description": "The King's University is a well-established post-secondary institution located in Edmonton, Alberta. Since its founding in 1979, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 900, The King's University is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.kingsu.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.kingsu.ca"
  },
  {
    "name": "St. Mary’s University",
    "city": "Calgary",
    "province": "Alberta",
    "country": "Canada",
    "students": 1000,
    "founded": 1986,
    "description": "St. Mary’s University is a well-established post-secondary institution located in Calgary, Alberta. Since its founding in 1986, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 1000, St. Mary’s University is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.stmu.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.stmu.ca"
  },
  {
    "name": "Ambrose University",
    "city": "Calgary",
    "province": "Alberta",
    "country": "Canada",
    "students": 900,
    "founded": 1921,
    "description": "Ambrose University is a well-established post-secondary institution located in Calgary, Alberta. Since its founding in 1921, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 900, Ambrose University is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.ambrose.edu, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.ambrose.edu"
  },
  {
    "name": "Burman University",
    "city": "Lacombe",
    "province": "Alberta",
    "country": "Canada",
    "students": 400,
    "founded": 1907,
    "description": "Burman University is a well-established post-secondary institution located in Lacombe, Alberta. Since its founding in 1907, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 400, Burman University is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.burmanu.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.burmanu.ca"
  },
  {
    "name": "Red Deer Polytechnic",
    "city": "Red Deer",
    "province": "Alberta",
    "country": "Canada",
    "students": 7500,
    "founded": 1964,
    "description": "Red Deer Polytechnic is a well-established post-secondary institution located in Red Deer, Alberta. Since its founding in 1964, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 7500, Red Deer Polytechnic is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.rdpolytech.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.rdpolytech.ca"
  },
  {
    "name": "Southern Alberta Institute of Technology (SAIT)",
    "city": "Calgary",
    "province": "Alberta",
    "country": "Canada",
    "students": 14000,
    "founded": 1916,
    "description": "Southern Alberta Institute of Technology (SAIT) is a well-established post-secondary institution located in Calgary, Alberta. Since its founding in 1916, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 14000, Southern Alberta Institute of Technology (SAIT) is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.sait.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.sait.ca"
  },
  {
    "name": "Northern Alberta Institute of Technology (NAIT)",
    "city": "Edmonton",
    "province": "Alberta",
    "country": "Canada",
    "students": 16000,
    "founded": 1962,
    "description": "Northern Alberta Institute of Technology (NAIT) is a well-established post-secondary institution located in Edmonton, Alberta. Since its founding in 1962, it has played a significant role in Alberta’s education system, offering a diverse range of academic and professional programs. With a student population of approximately 16000, Northern Alberta Institute of Technology (NAIT) is committed to academic excellence, innovation, and community engagement. Its campus fosters a rich and inclusive environment where students can thrive both personally and academically. The university's official website is https://www.nait.ca, where more detailed information can be found about admissions, programs, and campus life.",
    "website": "https://www.nait.ca"
  },
  {
    "name": "Brandon University",
    "city": "Brandon",
    "province": "Manitoba",
    "country": "Canada",
    "students": 3500,
    "founded": 1899,
    "description": "Brandon University is a respected institution of higher learning located in Brandon, Manitoba. Established in 1899, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 3500, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Brandon University emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Brandon University continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.brandonu.ca"
  },
  {
    "name": "Canadian Mennonite University",
    "city": "Winnipeg",
    "province": "Manitoba",
    "country": "Canada",
    "students": 600,
    "founded": 1999,
    "description": "Canadian Mennonite University (CMU), located in Winnipeg, Manitoba, is a small yet vibrant institution committed to delivering a transformative and faith-informed education. Founded in 1999 through the merger of several Mennonite colleges, CMU integrates liberal arts, sciences, and professional studies with an emphasis on peacebuilding, community service, and global responsibility. The university offers undergraduate and graduate degrees in a range of disciplines including theology, business, music, biology, and international development. Its academic environment is shaped by a commitment to dialogue, social justice, and ethical leadership. With around 600 students, CMU fosters close student-faculty relationships, personalized mentorship, and a welcoming, inclusive campus culture. The university's innovative programs and institutes, such as the Canadian School of Peacebuilding and Outtatown Discipleship School, encourage experiential learning and intercultural exchange. Rooted in its Anabaptist heritage yet open to people of all backgrounds, CMU cultivates graduates who are equipped to make meaningful contributions to their communities and the wider world. Learn more at the official website: https://www.cmu.ca.",
    "website": "https://www.cmu.ca"
  },
  {
    "name": "The University of Winnipeg",
    "city": "Winnipeg",
    "province": "Manitoba",
    "country": "Canada",
    "students": 10000,
    "founded": 1967,
    "description": "The University of Winnipeg is located in Winnipeg, Manitoba and has been serving the academic and local community since 1967. With a student body of approximately 10000, the university is dedicated to fostering academic excellence, community involvement, and personal development. The University of Winnipeg offers a wide variety of undergraduate and graduate programs, and emphasizes student-centered learning and innovation. It supports research, creativity, and leadership through modern facilities, experienced faculty, and a welcoming campus atmosphere. For more information, visit https://www.uwinnipeg.ca.",
    "website": "https://www.uwinnipeg.ca"
  },
  {
    "name": "Université de Saint-Boniface",
    "city": "Winnipeg",
    "province": "Manitoba",
    "country": "Canada",
    "students": 1400,
    "founded": 1818,
    "description": "Université de Saint-Boniface is a respected institution of higher learning located in Winnipeg, Manitoba. Established in 1818, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 1400, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Université de Saint-Boniface emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Université de Saint-Boniface continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://ustboniface.ca"
  },
  {
    "name": "University of Manitoba",
    "city": "Winnipeg",
    "province": "Manitoba",
    "country": "Canada",
    "students": 29000,
    "founded": 1877,
    "description": "The University of Manitoba (U of M) is Manitoba’s largest and most research-intensive university, located in Winnipeg and established in 1877. As Western Canada’s first university, it has a longstanding tradition of academic excellence and innovation. With over 29,000 students, including a vibrant international student body, U of M offers a comprehensive range of undergraduate and graduate programs in fields such as engineering, medicine, law, business, science, and the arts. The university is home to world-class research facilities, including the National Centre for Truth and Reconciliation and leading agricultural and climate science institutes. U of M prides itself on being a driver of social change, reconciliation, and community development. Students benefit from exceptional faculty, experiential learning, and a strong network of alumni across the globe. In addition to academics, the university supports a dynamic campus life through athletics, arts, student groups, and Indigenous engagement initiatives. A cornerstone of Manitoba’s academic and social landscape, the University of Manitoba continues to lead in creating knowledge and driving progress. More information can be found at https://umanitoba.ca.",
    "website": "https://umanitoba.ca"
  },
  {
    "name": "Crandall University",
    "city": "Moncton",
    "province": "New Brunswick",
    "country": "Canada",
    "students": 1000,
    "founded": 1949,
    "description": "Crandall University is a respected post-secondary institution located in Moncton, New Brunswick. Established in 1949, it has served as a cornerstone of academic growth and community leadership in the region. With an enrollment of approximately 1000 students, Crandall University offers a diverse portfolio of undergraduate and graduate programs designed to meet the evolving needs of society. The university is known for its student-centered approach to learning, with faculty dedicated to mentorship, academic excellence, and applied research. Its programs span a wide range of disciplines including arts, sciences, business, education, and theology, depending on its specific institutional focus. Crandall University fosters an inclusive and supportive campus culture that encourages innovation, ethical reasoning, and active community engagement. \n\nModern facilities, experiential learning opportunities, and partnerships with regional and global institutions make Crandall University a dynamic place for students to thrive both academically and personally. Students have access to small class sizes, interactive teaching environments, and career-building resources that prepare them to contribute meaningfully to their professions and communities. \n\nThe university’s campus life is enriched with student clubs, events, volunteer programs, and spiritual development for those who seek it. Crandall University is particularly dedicated to fostering leadership, intercultural understanding, and social responsibility through a curriculum that balances academic theory with real-world application. For more information about admissions, academic programs, and student life, visit the official website: https://www.crandallu.ca.",
    "website": "https://www.crandallu.ca"
  },
  {
    "name": "Kingswood University",
    "city": "Sussex",
    "province": "New Brunswick",
    "country": "Canada",
    "students": 400,
    "founded": 1945,
    "description": "Kingswood University is a respected post-secondary institution located in Sussex, New Brunswick. Established in 1945, it has served as a cornerstone of academic growth and community leadership in the region. With an enrollment of approximately 400 students, Kingswood University offers a diverse portfolio of undergraduate and graduate programs designed to meet the evolving needs of society. The university is known for its student-centered approach to learning, with faculty dedicated to mentorship, academic excellence, and applied research. Its programs span a wide range of disciplines including arts, sciences, business, education, and theology, depending on its specific institutional focus. Kingswood University fosters an inclusive and supportive campus culture that encourages innovation, ethical reasoning, and active community engagement. \n\nModern facilities, experiential learning opportunities, and partnerships with regional and global institutions make Kingswood University a dynamic place for students to thrive both academically and personally. Students have access to small class sizes, interactive teaching environments, and career-building resources that prepare them to contribute meaningfully to their professions and communities. \n\nThe university’s campus life is enriched with student clubs, events, volunteer programs, and spiritual development for those who seek it. Kingswood University is particularly dedicated to fostering leadership, intercultural understanding, and social responsibility through a curriculum that balances academic theory with real-world application. For more information about admissions, academic programs, and student life, visit the official website: https://www.kingswood.edu.",
    "website": "https://www.kingswood.edu"
  },
  {
    "name": "Mount Allison University",
    "city": "Sackville",
    "province": "New Brunswick",
    "country": "Canada",
    "students": 2200,
    "founded": 1839,
    "description": "Mount Allison University is a respected post-secondary institution located in Sackville, New Brunswick. Established in 1839, it has served as a cornerstone of academic growth and community leadership in the region. With an enrollment of approximately 2200 students, Mount Allison University offers a diverse portfolio of undergraduate and graduate programs designed to meet the evolving needs of society. The university is known for its student-centered approach to learning, with faculty dedicated to mentorship, academic excellence, and applied research. Its programs span a wide range of disciplines including arts, sciences, business, education, and theology, depending on its specific institutional focus. Mount Allison University fosters an inclusive and supportive campus culture that encourages innovation, ethical reasoning, and active community engagement. \n\nModern facilities, experiential learning opportunities, and partnerships with regional and global institutions make Mount Allison University a dynamic place for students to thrive both academically and personally. Students have access to small class sizes, interactive teaching environments, and career-building resources that prepare them to contribute meaningfully to their professions and communities. \n\nThe university’s campus life is enriched with student clubs, events, volunteer programs, and spiritual development for those who seek it. Mount Allison University is particularly dedicated to fostering leadership, intercultural understanding, and social responsibility through a curriculum that balances academic theory with real-world application. For more information about admissions, academic programs, and student life, visit the official website: https://www.mta.ca.",
    "website": "https://www.mta.ca"
  },
  {
    "name": "St. Stephen's University",
    "city": "St. Stephen",
    "province": "New Brunswick",
    "country": "Canada",
    "students": 100,
    "founded": 1975,
    "description": "St. Stephen's University is a respected post-secondary institution located in St. Stephen, New Brunswick. Established in 1975, it has served as a cornerstone of academic growth and community leadership in the region. With an enrollment of approximately 100 students, St. Stephen's University offers a diverse portfolio of undergraduate and graduate programs designed to meet the evolving needs of society. The university is known for its student-centered approach to learning, with faculty dedicated to mentorship, academic excellence, and applied research. Its programs span a wide range of disciplines including arts, sciences, business, education, and theology, depending on its specific institutional focus. St. Stephen's University fosters an inclusive and supportive campus culture that encourages innovation, ethical reasoning, and active community engagement. \n\nModern facilities, experiential learning opportunities, and partnerships with regional and global institutions make St. Stephen's University a dynamic place for students to thrive both academically and personally. Students have access to small class sizes, interactive teaching environments, and career-building resources that prepare them to contribute meaningfully to their professions and communities. \n\nThe university’s campus life is enriched with student clubs, events, volunteer programs, and spiritual development for those who seek it. St. Stephen's University is particularly dedicated to fostering leadership, intercultural understanding, and social responsibility through a curriculum that balances academic theory with real-world application. For more information about admissions, academic programs, and student life, visit the official website: https://www.ssu.ca.",
    "website": "https://www.ssu.ca"
  },
  {
    "name": "St. Thomas University",
    "city": "Fredericton",
    "province": "New Brunswick",
    "country": "Canada",
    "students": 1800,
    "founded": 1910,
    "description": "St. Thomas University is a respected post-secondary institution located in Fredericton, New Brunswick. Established in 1910, it has served as a cornerstone of academic growth and community leadership in the region. With an enrollment of approximately 1800 students, St. Thomas University offers a diverse portfolio of undergraduate and graduate programs designed to meet the evolving needs of society. The university is known for its student-centered approach to learning, with faculty dedicated to mentorship, academic excellence, and applied research. Its programs span a wide range of disciplines including arts, sciences, business, education, and theology, depending on its specific institutional focus. St. Thomas University fosters an inclusive and supportive campus culture that encourages innovation, ethical reasoning, and active community engagement. \n\nModern facilities, experiential learning opportunities, and partnerships with regional and global institutions make St. Thomas University a dynamic place for students to thrive both academically and personally. Students have access to small class sizes, interactive teaching environments, and career-building resources that prepare them to contribute meaningfully to their professions and communities. \n\nThe university’s campus life is enriched with student clubs, events, volunteer programs, and spiritual development for those who seek it. St. Thomas University is particularly dedicated to fostering leadership, intercultural understanding, and social responsibility through a curriculum that balances academic theory with real-world application. For more information about admissions, academic programs, and student life, visit the official website: https://www.stu.ca.",
    "website": "https://www.stu.ca"
  },
  {
    "name": "Université de Moncton",
    "city": "Moncton",
    "province": "New Brunswick",
    "country": "Canada",
    "students": 4700,
    "founded": 1963,
    "description": "Université de Moncton is a respected institution of higher learning located in Moncton, New Brunswick. Established in 1963, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 4700, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Université de Moncton emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Université de Moncton continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.umoncton.ca"
  },
  {
    "name": "University of New Brunswick",
    "city": "Fredericton",
    "province": "New Brunswick",
    "country": "Canada",
    "students": 8500,
    "founded": 1785,
    "description": "University of New Brunswick is a respected institution of higher learning located in Fredericton, New Brunswick. Established in 1785, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 10000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, University of New Brunswick emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, University of New Brunswick continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.unb.ca"
  },
  {
    "name": "Yorkville University",
    "city": "Fredericton",
    "province": "New Brunswick",
    "country": "Canada",
    "students": 5000,
    "founded": 2004,
    "description": "Yorkville University is a respected post-secondary institution located in Fredericton, New Brunswick. Established in 2004, it has served as a cornerstone of academic growth and community leadership in the region. With an enrollment of approximately 5000 students, Yorkville University offers a diverse portfolio of undergraduate and graduate programs designed to meet the evolving needs of society. The university is known for its student-centered approach to learning, with faculty dedicated to mentorship, academic excellence, and applied research. Its programs span a wide range of disciplines including arts, sciences, business, education, and theology, depending on its specific institutional focus. Yorkville University fosters an inclusive and supportive campus culture that encourages innovation, ethical reasoning, and active community engagement. \n\nModern facilities, experiential learning opportunities, and partnerships with regional and global institutions make Yorkville University a dynamic place for students to thrive both academically and personally. Students have access to small class sizes, interactive teaching environments, and career-building resources that prepare them to contribute meaningfully to their professions and communities. \n\nThe university’s campus life is enriched with student clubs, events, volunteer programs, and spiritual development for those who seek it. Yorkville University is particularly dedicated to fostering leadership, intercultural understanding, and social responsibility through a curriculum that balances academic theory with real-world application. For more information about admissions, academic programs, and student life, visit the official website: https://www.yorkvilleu.ca.",
    "website": "https://www.yorkvilleu.ca"
  },
  {
    "name": "Memorial University of Newfoundland",
    "city": "St. John's",
    "province": "Newfoundland and Labrador",
    "country": "Canada",
    "students": 18000,
    "founded": 1925,
    "description": "Memorial University of Newfoundland is a respected institution of higher learning located in St. John's, Newfoundland and Labrador. Established in 1925, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 18000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Memorial University of Newfoundland emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Memorial University of Newfoundland continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.mun.ca"
  },
  {
    "name": "College of the North Atlantic",
    "city": "Stephenville",
    "province": "Newfoundland and Labrador",
    "country": "Canada",
    "students": 7500,
    "founded": 1997,
    "website": "https://www.cna.nl.ca",
    "description": "College of the North Atlantic (CNA), headquartered in Stephenville, Newfoundland and Labrador, is one of the largest post-secondary educational institutions in Atlantic Canada. Established in 1997 through the amalgamation of several regional colleges, CNA offers a broad range of academic, technical, and vocational training programs. With 17 campuses located throughout the province and one international campus in Qatar, CNA serves over 7,500 full-time students annually.\n\nCNA's offerings span various disciplines including health sciences, engineering technology, information technology, business, natural resources, and applied arts. The college focuses on hands-on, career-oriented education that prepares students for direct entry into the workforce or for further studies. It has a strong emphasis on community involvement, Indigenous engagement, and applied research that benefits regional economic development.\n\nKnown for its accessibility, affordability, and supportive learning environment, CNA fosters a student-centered approach where innovation and practical skills are at the forefront. The institution collaborates with local industries and governments to ensure that its curriculum is relevant and aligned with labor market needs. Learn more at the official website: https://www.cna.nl.ca."
  },
  {
    "name": "Acadia University",
    "city": "Wolfville",
    "province": "Nova Scotia",
    "country": "Canada",
    "students": 3800,
    "founded": 1838,
    "description": "Acadia University is located in Wolfville, Nova Scotia and has a strong academic tradition dating back to its founding in 1838. With a student population of approximately 3800, it offers a diverse array of programs designed to foster critical thinking, professional development, and community engagement. Known for its commitment to excellence, inclusivity, and student-centered learning, Acadia University continues to shape future leaders through research, experiential education, and global awareness. Learn more at https://www2.acadiau.ca.",
    "website": "https://www2.acadiau.ca"
  },
  {
    "name": "Cape Breton University",
    "city": "Sydney",
    "province": "Nova Scotia",
    "country": "Canada",
    "students": 5200,
    "founded": 1951,
    "description": "Cape Breton University is located in Sydney, Nova Scotia and has a strong academic tradition dating back to its founding in 1951. With a student population of approximately 5200, it offers a diverse array of programs designed to foster critical thinking, professional development, and community engagement. Known for its commitment to excellence, inclusivity, and student-centered learning, Cape Breton University continues to shape future leaders through research, experiential education, and global awareness. Learn more at https://www.cbu.ca.",
    "website": "https://www.cbu.ca"
  },
  {
    "name": "Dalhousie University",
    "city": "Halifax",
    "province": "Nova Scotia",
    "country": "Canada",
    "students": 20000,
    "founded": 1818,
    "description": "Dalhousie University is a respected institution of higher learning located in Halifax, Nova Scotia. Established in 1818, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 20000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Dalhousie University emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Dalhousie University continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.dal.ca"
  },
  {
    "name": "Mount Saint Vincent University",
    "city": "Halifax",
    "province": "Nova Scotia",
    "country": "Canada",
    "students": 4000,
    "founded": 1873,
    "description": "Mount Saint Vincent University is located in Halifax, Nova Scotia and has a strong academic tradition dating back to its founding in 1873. With a student population of approximately 4000, it offers a diverse array of programs designed to foster critical thinking, professional development, and community engagement. Known for its commitment to excellence, inclusivity, and student-centered learning, Mount Saint Vincent University continues to shape future leaders through research, experiential education, and global awareness. Learn more at https://www.msvu.ca.",
    "website": "https://www.msvu.ca"
  },
  {
    "name": "NSCAD University",
    "city": "Halifax",
    "province": "Nova Scotia",
    "country": "Canada",
    "students": 800,
    "founded": 1887,
    "description": "NSCAD University is located in Halifax, Nova Scotia and has a strong academic tradition dating back to its founding in 1887. With a student population of approximately 800, it offers a diverse array of programs designed to foster critical thinking, professional development, and community engagement. Known for its commitment to excellence, inclusivity, and student-centered learning, NSCAD University continues to shape future leaders through research, experiential education, and global awareness. Learn more at https://nscad.ca.",
    "website": "https://nscad.ca"
  },
  {
    "name": "Saint Mary's University",
    "city": "Halifax",
    "province": "Nova Scotia",
    "country": "Canada",
    "students": 6500,
    "founded": 1802,
    "description": "Saint Mary's University is located in Halifax, Nova Scotia and has a strong academic tradition dating back to its founding in 1802. With a student population of approximately 6500, it offers a diverse array of programs designed to foster critical thinking, professional development, and community engagement. Known for its commitment to excellence, inclusivity, and student-centered learning, Saint Mary's University continues to shape future leaders through research, experiential education, and global awareness. Learn more at https://www.smu.ca.",
    "website": "https://www.smu.ca"
  },
  {
    "name": "St. Francis Xavier University",
    "city": "Antigonish",
    "province": "Nova Scotia",
    "country": "Canada",
    "students": 5000,
    "founded": 1853,
    "description": "St. Francis Xavier University is located in Antigonish, Nova Scotia and has a strong academic tradition dating back to its founding in 1853. With a student population of approximately 5000, it offers a diverse array of programs designed to foster critical thinking, professional development, and community engagement. Known for its commitment to excellence, inclusivity, and student-centered learning, St. Francis Xavier University continues to shape future leaders through research, experiential education, and global awareness. Learn more at https://www.stfx.ca.",
    "website": "https://www.stfx.ca"
  },
  {
    "name": "Université Sainte-Anne",
    "city": "Pointe de l'Église",
    "province": "Nova Scotia",
    "country": "Canada",
    "students": 500,
    "founded": 1890,
    "description": "Université Sainte-Anne is located in Pointe de l'Église, Nova Scotia and has a strong academic tradition dating back to its founding in 1890. With a student population of approximately 500, it offers a diverse array of programs designed to foster critical thinking, professional development, and community engagement. Known for its commitment to excellence, inclusivity, and student-centered learning, Université Sainte-Anne continues to shape future leaders through research, experiential education, and global awareness. Learn more at https://www.usainteanne.ca.",
    "website": "https://www.usainteanne.ca"
  },
  {
    "name": "University of King's College",
    "city": "Halifax",
    "province": "Nova Scotia",
    "country": "Canada",
    "students": 900,
    "founded": 1789,
    "description": "University of King's College is located in Halifax, Nova Scotia and has a strong academic tradition dating back to its founding in 1789. With a student population of approximately 900, it offers a diverse array of programs designed to foster critical thinking, professional development, and community engagement. Known for its commitment to excellence, inclusivity, and student-centered learning, University of King's College continues to shape future leaders through research, experiential education, and global awareness. Learn more at https://ukings.ca.",
    "website": "https://ukings.ca"
  },
  {
    "name": "Algoma University",
    "city": "Sault Ste. Marie",
    "province": "Ontario",
    "country": "Canada",
    "students": 2000,
    "founded": 1965,
    "description": "Algoma University is a recognized institution in Sault Ste. Marie, Ontario. Since its founding in 1965, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 2000 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.algomau.ca.",
    "website": "https://www.algomau.ca"
  },
  {
    "name": "Brock University",
    "city": "St. Catharines",
    "province": "Ontario",
    "country": "Canada",
    "students": 19000,
    "founded": 1964,
    "description": "Brock University is a recognized institution in St. Catharines, Ontario. Since its founding in 1964, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 19000 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://brocku.ca.",
    "website": "https://brocku.ca"
  },
  {
    "name": "Carleton University",
    "city": "Ottawa",
    "province": "Ontario",
    "country": "Canada",
    "students": 31000,
    "founded": 1942,
    "description": "Carleton University is a recognized institution in Ottawa, Ontario. Since its founding in 1942, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 31000 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://carleton.ca.",
    "website": "https://carleton.ca"
  },
  {
    "name": "Collège Universitaire Dominicain",
    "city": "Ottawa",
    "province": "Ontario",
    "country": "Canada",
    "students": 300,
    "founded": 1900,
    "description": "Collège Universitaire Dominicain is a recognized institution in Ottawa, Ontario. Since its founding in 1900, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 300 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://udominicaine.ca.",
    "website": "https://udominicaine.ca"
  },
  {
    "name": "Lakehead University",
    "city": "Thunder Bay",
    "province": "Ontario",
    "country": "Canada",
    "students": 8500,
    "founded": 1965,
    "description": "Lakehead University is a recognized institution in Thunder Bay, Ontario. Since its founding in 1965, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 8500 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.lakeheadu.ca.",
    "website": "https://www.lakeheadu.ca"
  },
  {
    "name": "Laurentian University",
    "city": "Sudbury",
    "province": "Ontario",
    "country": "Canada",
    "students": 6000,
    "founded": 1960,
    "description": "Laurentian University is a recognized institution in Sudbury, Ontario. Since its founding in 1960, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 6000 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://laurentian.ca.",
    "website": "https://laurentian.ca"
  },
  {
    "name": "McMaster University",
    "city": "Hamilton",
    "province": "Ontario",
    "country": "Canada",
    "students": 37000,
    "founded": 1887,
    "description": "McMaster University is a respected institution of higher learning located in Hamilton, Ontario. Established in 1887, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 37000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, McMaster University emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, McMaster University continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.mcmaster.ca"
  },
  {
    "name": "Nipissing University",
    "city": "North Bay",
    "province": "Ontario",
    "country": "Canada",
    "students": 4200,
    "founded": 1992,
    "description": "Nipissing University is a recognized institution in North Bay, Ontario. Since its founding in 1992, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 4200 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.nipissingu.ca.",
    "website": "https://www.nipissingu.ca"
  },
  {
    "name": "OCAD University",
    "city": "Toronto",
    "province": "Ontario",
    "country": "Canada",
    "students": 4500,
    "founded": 1876,
    "description": "OCAD University is a recognized institution in Toronto, Ontario. Since its founding in 1876, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 4500 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.ocadu.ca.",
    "website": "https://www.ocadu.ca"
  },
  {
    "name": "Ontario Tech University",
    "city": "Oshawa",
    "province": "Ontario",
    "country": "Canada",
    "students": 10800,
    "founded": 2002,
    "description": "Ontario Tech University is a recognized institution in Oshawa, Ontario. Since its founding in 2002, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 10800 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://ontariotechu.ca.",
    "website": "https://ontariotechu.ca"
  },
  {
    "name": "Queen's University",
    "city": "Kingston",
    "province": "Ontario",
    "country": "Canada",
    "students": 31000,
    "founded": 1841,
    "description": "Queen's University is a respected institution of higher learning located in Kingston, Ontario. Established in 1841, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 31000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Queen's University emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Queen's University continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.queensu.ca"
  },
  {
    "name": "Redeemer University",
    "city": "Ancaster",
    "province": "Ontario",
    "country": "Canada",
    "students": 1000,
    "founded": 1982,
    "description": "Redeemer University is a recognized institution in Ancaster, Ontario. Since its founding in 1982, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 1000 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.redeemer.ca.",
    "website": "https://www.redeemer.ca"
  },
  {
    "name": "Royal Military College of Canada",
    "city": "Kingston",
    "province": "Ontario",
    "country": "Canada",
    "students": 2500,
    "founded": 1876,
    "description": "Royal Military College of Canada is a recognized institution in Kingston, Ontario. Since its founding in 1876, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 2500 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.rmc-cmr.ca.",
    "website": "https://www.rmc-cmr.ca"
  },
  {
    "name": "Toronto Metropolitan University",
    "city": "Toronto",
    "province": "Ontario",
    "country": "Canada",
    "students": 48000,
    "founded": 1948,
    "description": "Toronto Metropolitan University is a recognized institution in Toronto, Ontario. Since its founding in 1948, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 48000 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.torontomu.ca.",
    "website": "https://www.torontomu.ca"
  },
  {
    "name": "Trent University",
    "city": "Peterborough",
    "province": "Ontario",
    "country": "Canada",
    "students": 12000,
    "founded": 1964,
    "description": "Trent University is a recognized institution in Peterborough, Ontario. Since its founding in 1964, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 12000 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.trentu.ca.",
    "website": "https://www.trentu.ca"
  },
  {
    "name": "Université de Hearst",
    "city": "Hearst",
    "province": "Ontario",
    "country": "Canada",
    "students": 400,
    "founded": 1953,
    "description": "Université de Hearst is a recognized institution in Hearst, Ontario. Since its founding in 1953, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 400 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.uhearst.ca.",
    "website": "https://www.uhearst.ca"
  },
  {
    "name": "University of Guelph",
    "city": "Guelph",
    "province": "Ontario",
    "country": "Canada",
    "students": 29000,
    "founded": 1964,
    "description": "University of Guelph is a respected institution of higher learning located in Guelph, Ontario. Established in 1964, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 30000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, University of Guelph emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, University of Guelph continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.uoguelph.ca"
  },
  {
    "name": "University of Ottawa",
    "city": "Ottawa",
    "province": "Ontario",
    "country": "Canada",
    "students": 42000,
    "founded": 1848,
    "description": "University of Ottawa is a respected institution of higher learning located in Ottawa, Ontario. Established in 1848, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 42000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, University of Ottawa emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, University of Ottawa continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.uottawa.ca"
  },
  {
    "name": "University of Toronto",
    "city": "Toronto",
    "province": "Ontario",
    "country": "Canada",
    "students": 90000,
    "founded": 1827,
    "description": "The University of Toronto (U of T), established in 1827, is Canada's leading institution of higher learning and a global leader in research and teaching. Located in the vibrant city of Toronto, Ontario, U of T has consistently ranked among the top universities worldwide. The university offers a wide variety of undergraduate, graduate, and professional programs across multiple disciplines, including the arts and sciences, engineering, medicine, law, and business. It operates three campuses: St. George (downtown Toronto), Scarborough, and Mississauga. U of T is known for its commitment to academic excellence, innovation, and inclusivity, welcoming students from over 160 countries. The institution has produced numerous Nobel laureates, Rhodes Scholars, and other distinguished alumni. U of T’s research output is immense, often in partnership with global industry leaders and supported by top-tier facilities. The university fosters a collaborative environment that encourages creativity, critical thinking, and real-world application of knowledge. With over 90,000 students, U of T offers extensive opportunities in research, co-curricular involvement, and entrepreneurship. Its libraries are among the largest in North America, and the student experience is enriched by a wide array of clubs, athletics, and cultural events. As a university situated in Canada’s most populous city, it also benefits from strong industry connections, providing pathways to employment and advancement. Whether pursuing arts, sciences, or professional studies, students at the University of Toronto are equipped with the tools to lead and innovate in a rapidly changing world.",
    "website": "https://www.utoronto.ca"
  },
  {
    "name": "University of Waterloo",
    "city": "Waterloo",
    "province": "Ontario",
    "country": "Canada",
    "students": 42000,
    "founded": 1957,
    "description": "University of Waterloo is a recognized institution in Waterloo, Ontario. Since its founding in 1957, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 42000 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://uwaterloo.ca.",
    "website": "https://uwaterloo.ca"
  },
  {
    "name": "University of Windsor",
    "city": "Windsor",
    "province": "Ontario",
    "country": "Canada",
    "students": 16000,
    "founded": 1963,
    "description": "University of Windsor is a recognized institution in Windsor, Ontario. Since its founding in 1963, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 16000 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.uwindsor.ca.",
    "website": "https://www.uwindsor.ca"
  },
  {
    "name": "Western University",
    "city": "London",
    "province": "Ontario",
    "country": "Canada",
    "students": 28000,
    "founded": 1878,
    "description": "Western University is a respected institution of higher learning located in London, Ontario. Established in 1878, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 28000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Western University emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Western University continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.uwo.ca"
  },
  {
    "name": "Wilfrid Laurier University",
    "city": "Waterloo",
    "province": "Ontario",
    "country": "Canada",
    "students": 20000,
    "founded": 1911,
    "description": "Wilfrid Laurier University is a recognized institution in Waterloo, Ontario. Since its founding in 1911, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 20000 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.wlu.ca.",
    "website": "https://www.wlu.ca"
  },
  {
    "name": "York University",
    "city": "Toronto",
    "province": "Ontario",
    "country": "Canada",
    "students": 55000,
    "founded": 1959,
    "description": "York University is a recognized institution in Toronto, Ontario. Since its founding in 1959, it has been providing quality post-secondary education and contributing to the cultural, economic, and intellectual vitality of the region. With approximately 55000 students, the university offers diverse academic programs and opportunities for research, innovation, and leadership development. Learn more at https://www.yorku.ca.",
    "website": "https://www.yorku.ca"
  },
  {
    "name": "University of Prince Edward Island",
    "city": "Charlottetown",
    "province": "Prince Edward Island",
    "country": "Canada",
    "students": 5000,
    "founded": 1969,
    "website": "https://www.upei.ca",
    "description": "University of Prince Edward Island is a respected institution of higher learning located in Charlottetown, Prince Edward Island. Established in 1969, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 5000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, University of Prince Edward Island emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, University of Prince Edward Island continues to uphold its mission of nurturing the next generation of leaders and innovators."
  },
  {
    "name": "Campion College at the University of Regina",
    "city": "Regina",
    "province": "Saskatchewan",
    "country": "Canada",
    "students": 650,
    "founded": 1917,
    "description": "Campion College at the University of Regina is a recognized institution in Regina, Saskatchewan, established in 1917. Serving approximately 650 students, the university offers a variety of academic and professional programs focused on student development, community engagement, and academic excellence. Learn more at https://campioncollege.ca.",
    "website": "https://campioncollege.ca"
  },
  {
    "name": "First Nations University of Canada",
    "city": "Regina",
    "province": "Saskatchewan",
    "country": "Canada",
    "students": 800,
    "founded": 1976,
    "description": "First Nations University of Canada is a recognized institution in Regina, Saskatchewan, established in 1976. Serving approximately 800 students, the university offers a variety of academic and professional programs focused on student development, community engagement, and academic excellence. Learn more at https://www.fnuniv.ca.",
    "website": "https://www.fnuniv.ca"
  },
  {
    "name": "Luther College at the University of Regina",
    "city": "Regina",
    "province": "Saskatchewan",
    "country": "Canada",
    "students": 600,
    "founded": 1913,
    "description": "Luther College at the University of Regina is a recognized institution in Regina, Saskatchewan, established in 1913. Serving approximately 600 students, the university offers a variety of academic and professional programs focused on student development, community engagement, and academic excellence. Learn more at https://www.luthercollege.edu/university.",
    "website": "https://www.luthercollege.edu/university"
  },
  {
    "name": "St. Thomas More College",
    "city": "Saskatoon",
    "province": "Saskatchewan",
    "country": "Canada",
    "students": 550,
    "founded": 1936,
    "description": "St. Thomas More College is a recognized institution in Saskatoon, Saskatchewan, established in 1936. Serving approximately 550 students, the university offers a variety of academic and professional programs focused on student development, community engagement, and academic excellence. Learn more at https://stmcollege.ca.",
    "website": "https://stmcollege.ca"
  },
  {
    "name": "University of Regina",
    "city": "Regina",
    "province": "Saskatchewan",
    "country": "Canada",
    "students": 16000,
    "founded": 1911,
    "description": "University of Regina is a respected institution of higher learning located in Regina, Saskatchewan. Established in 1911, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 16000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, University of Regina emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, University of Regina continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.uregina.ca"
  },
  {
    "name": "University of Saskatchewan",
    "city": "Saskatoon",
    "province": "Saskatchewan",
    "country": "Canada",
    "students": 25000,
    "founded": 1907,
    "description": "University of Saskatchewan is a respected institution of higher learning located in Saskatoon, Saskatchewan. Established in 1907, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 25000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, University of Saskatchewan emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, University of Saskatchewan continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.usask.ca"
  },
  {
    "name": "Yukon University",
    "city": "Whitehorse",
    "province": "Yukon",
    "country": "Canada",
    "students": 1300,
    "founded": 2020,
    "description": "Yukon University is a recognized institution in Whitehorse, Yukon, established in 2020. Serving approximately 1300 students, the university offers a variety of academic and professional programs focused on student development, community engagement, and academic excellence. Learn more at https://www.yukonu.ca.",
    "website": "https://www.yukonu.ca"
  },
  {
    "name": "Bishop's University",
    "city": "Sherbrooke",
    "province": "Quebec",
    "country": "Canada",
    "students": 2700,
    "founded": 1843,
    "description": "Bishop's University, located in Sherbrooke, Quebec, has been serving students since 1843. With an enrollment of approximately 2700, the university offers a wide range of programs and emphasizes academic excellence, innovation, and community engagement. It plays a critical role in Quebec’s higher education system and continues to attract students from across Canada and around the world. Learn more at https://www.ubishops.ca.",
    "website": "https://www.ubishops.ca"
  },
  {
    "name": "Concordia University",
    "city": "Montreal",
    "province": "Quebec",
    "country": "Canada",
    "students": 46000,
    "founded": 1974,
    "description": "Concordia University, located in Montreal, Quebec, has been serving students since 1974. With an enrollment of approximately 46000, the university offers a wide range of programs and emphasizes academic excellence, innovation, and community engagement. It plays a critical role in Quebec’s higher education system and continues to attract students from across Canada and around the world. Learn more at https://www.concordia.ca.",
    "website": "https://www.concordia.ca"
  },
  {
    "name": "École de technologie supérieure (ÉTS)",
    "city": "Montreal",
    "province": "Quebec",
    "country": "Canada",
    "students": 11000,
    "founded": 1974,
    "description": "École de technologie supérieure (ÉTS), located in Montreal, Quebec, has been serving students since 1974. With an enrollment of approximately 11000, the university offers a wide range of programs and emphasizes academic excellence, innovation, and community engagement. It plays a critical role in Quebec’s higher education system and continues to attract students from across Canada and around the world. Learn more at https://www.etsmtl.ca.",
    "website": "https://www.etsmtl.ca"
  },
  {
    "name": "HEC Montréal",
    "city": "Montreal",
    "province": "Quebec",
    "country": "Canada",
    "students": 15000,
    "founded": 1907,
    "description": "HEC Montréal, located in Montreal, Quebec, has been serving students since 1907. With an enrollment of approximately 15000, the university offers a wide range of programs and emphasizes academic excellence, innovation, and community engagement. It plays a critical role in Quebec’s higher education system and continues to attract students from across Canada and around the world. Learn more at https://www.hec.ca.",
    "website": "https://www.hec.ca"
  },
  {
    "name": "Institut national de la recherche scientifique (INRS)",
    "city": "Quebec City",
    "province": "Quebec",
    "country": "Canada",
    "students": 700,
    "founded": 1969,
    "description": "Institut national de la recherche scientifique (INRS), located in Quebec City, Quebec, has been serving students since 1969. With an enrollment of approximately 700, the university offers a wide range of programs and emphasizes academic excellence, innovation, and community engagement. It plays a critical role in Quebec’s higher education system and continues to attract students from across Canada and around the world. Learn more at https://inrs.ca.",
    "website": "https://inrs.ca"
  },
  {
    "name": "McGill University",
    "city": "Montreal",
    "province": "Quebec",
    "country": "Canada",
    "students": 40000,
    "founded": 1821,
    "description": "McGill University, founded in 1821, is located in Montreal, Quebec and is one of Canada’s oldest and most prestigious institutions. McGill is globally recognized for its academic rigor, excellence in research, and commitment to producing innovative leaders. The university offers more than 300 programs in fields such as medicine, law, engineering, business, and the humanities. With a student population representing over 150 countries, McGill is one of the most internationally diverse universities in Canada. It boasts a long history of groundbreaking research and is home to a number of major research institutes and centers. Students benefit from an urban campus located at the foot of Mount Royal, providing access to the vibrant cultural and professional life of Montreal. McGill’s faculty and alumni include Nobel Prize winners, astronauts, world leaders, and cultural icons. Known for a strong emphasis on undergraduate education and research excellence, McGill also fosters a vibrant student community through clubs, athletics, and student-led initiatives. Its teaching hospitals are ranked among the best in the world, and the Faculty of Medicine is internationally renowned. Whether through innovation, community service, or global engagement, McGill University remains committed to shaping the future through knowledge and discovery.",
    "website": "https://www.mcgill.ca"
  },
  {
    "name": "Université de Montréal",
    "city": "Montreal",
    "province": "Quebec",
    "country": "Canada",
    "students": 67000,
    "founded": 1878,
    "description": "Université de Montréal, located in Montreal, Quebec, has been serving students since 1878. With an enrollment of approximately 67000, the university offers a wide range of programs and emphasizes academic excellence, innovation, and community engagement. It plays a critical role in Quebec’s higher education system and continues to attract students from across Canada and around the world. Learn more at https://www.umontreal.ca.",
    "website": "https://www.umontreal.ca"
  },
  {
    "name": "Université de Sherbrooke",
    "city": "Sherbrooke",
    "province": "Quebec",
    "country": "Canada",
    "students": 31000,
    "founded": 1954,
    "description": "Université de Sherbrooke is a respected institution of higher learning located in Sherbrooke, Quebec. Established in 1954, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 31000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Université de Sherbrooke emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Université de Sherbrooke continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.usherbrooke.ca"
  },
  {
    "name": "Université du Québec à Chicoutimi",
    "city": "Chicoutimi",
    "province": "Quebec",
    "country": "Canada",
    "students": 6500,
    "founded": 1969,
    "description": "Université du Québec à Chicoutimi is a respected institution of higher learning located in Chicoutimi, Quebec. Established in 1969, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 6500, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Université du Québec à Chicoutimi emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Université du Québec à Chicoutimi continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.uqac.ca"
  },
  {
    "name": "Université du Québec à Montréal (UQAM)",
    "city": "Montreal",
    "province": "Quebec",
    "country": "Canada",
    "students": 40000,
    "founded": 1969,
    "description": "Université du Québec à Montréal (UQAM), located in Montreal, Quebec, has been serving students since 1969. With an enrollment of approximately 40000, the university offers a wide range of programs and emphasizes academic excellence, innovation, and community engagement. It plays a critical role in Quebec’s higher education system and continues to attract students from across Canada and around the world. Learn more at https://uqam.ca.",
    "website": "https://uqam.ca"
  },
  {
    "name": "Université du Québec à Rimouski",
    "city": "Rimouski",
    "province": "Quebec",
    "country": "Canada",
    "students": 6500,
    "founded": 1969,
    "description": "Université du Québec à Rimouski is a respected institution of higher learning located in Rimouski, Quebec. Established in 1969, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 6500, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Université du Québec à Rimouski emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Université du Québec à Rimouski continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.uqar.ca"
  },
  {
    "name": "Université du Québec à Trois-Rivières",
    "city": "Trois-Rivières",
    "province": "Quebec",
    "country": "Canada",
    "students": 15000,
    "founded": 1969,
    "description": "Université du Québec à Trois-Rivières is a respected institution of higher learning located in Trois-Rivières, Quebec. Established in 1969, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 15000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Université du Québec à Trois-Rivières emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Université du Québec à Trois-Rivières continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.uqtr.ca"
  },
  {
    "name": "Université du Québec en Abitibi-Témiscamingue",
    "city": "Rouyn-Noranda",
    "province": "Quebec",
    "country": "Canada",
    "students": 2500,
    "founded": 1983,
    "description": "Université du Québec en Abitibi-Témiscamingue is a respected institution of higher learning located in Rouyn-Noranda, Quebec. Established in 1983, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 2500, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Université du Québec en Abitibi-Témiscamingue emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Université du Québec en Abitibi-Témiscamingue continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.uqat.ca"
  },
  {
    "name": "Université du Québec en Outaouais",
    "city": "Gatineau",
    "province": "Quebec",
    "country": "Canada",
    "students": 7000,
    "founded": 1981,
    "description": "Université du Québec en Outaouais is a respected institution of higher learning located in Gatineau, Quebec. Established in 1981, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 7000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Université du Québec en Outaouais emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Université du Québec en Outaouais continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://uqo.ca"
  },
  {
    "name": "Université Laval",
    "city": "Quebec City",
    "province": "Quebec",
    "country": "Canada",
    "students": 43000,
    "founded": 1852,
    "description": "Université Laval is a respected institution of higher learning located in Quebec City, Quebec. Established in 1852, it has served as a hub for academic excellence, research, and community development for many years. With a student body of approximately 43000, the university offers a diverse array of undergraduate, graduate, and professional programs spanning disciplines such as the arts, sciences, engineering, business, and health sciences. As a prominent institution within Canada, Université Laval emphasizes innovation, critical thinking, and experiential learning. Students benefit from vibrant campus life, top-tier facilities, and opportunities to engage in cutting-edge research and international collaborations. The university also maintains a strong connection with industry partners and local communities, providing students with real-world experiences that enhance career readiness. Its graduates are known for making meaningful contributions in their fields across Canada and around the globe. The university fosters a culture of inclusivity, encouraging students of all backgrounds to thrive academically, socially, and professionally. Whether through academic pursuits, extracurricular involvement, or community outreach, Université Laval continues to uphold its mission of nurturing the next generation of leaders and innovators.",
    "website": "https://www.ulaval.ca"
  },
  {
    "name": "Université TÉLUQ",
    "city": "Montreal",
    "province": "Quebec",
    "country": "Canada",
    "students": 18000,
    "founded": 1972,
    "description": "Université TÉLUQ, located in Montreal, Quebec, has been serving students since 1972. With an enrollment of approximately 18000, the university offers a wide range of programs and emphasizes academic excellence, innovation, and community engagement. It plays a critical role in Quebec’s higher education system and continues to attract students from across Canada and around the world. Learn more at https://www.teluq.ca.",
    "website": "https://www.teluq.ca"
  },
  {
    "name": "École Polytechnique de Montréal",
    "city": "Montreal",
    "founded": 1873,
    "students": 9000,
    "website": "https://www.polymtl.ca",
    "province": "Quebec",
    "country": "Canada",
    "description": "École Polytechnique de Montréal, located in Montreal, Quebec, is a leading institution established in 1873 that provides specialized education in its respective domain. With an enrollment of approximately 9000 students, the university is known for its strong emphasis on academic excellence, research, and practical experience. École Polytechnique de Montréal plays a significant role in preparing professionals to address contemporary challenges and contribute meaningfully to society. Learn more at https://www.polymtl.ca."
  },
  {
    "name": "École Nationale d'Administration Publique",
    "city": "Quebec City",
    "founded": 1969,
    "students": 2000,
    "website": "https://www.enap.ca",
    "province": "Quebec",
    "country": "Canada",
    "description": "École Nationale d'Administration Publique, located in Quebec City, Quebec, is a leading institution established in 1969 that provides specialized education in its respective domain. With an enrollment of approximately 2000 students, the university is known for its strong emphasis on academic excellence, research, and practical experience. École Nationale d'Administration Publique plays a significant role in preparing professionals to address contemporary challenges and contribute meaningfully to society. Learn more at https://www.enap.ca."
  },
  {
    "name": "British Columbia Institute of Technology",
    "city": "Burnaby",
    "province": "British Columbia",
    "country": "Canada",
    "students": 45000,
    "founded": 1964,
    "description": "British Columbia Institute of Technology is a prominent institution located in Burnaby, British Columbia. Founded in 1964, the university serves a diverse student body of approximately 45000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, British Columbia Institute of Technology plays a key role in British Columbia's educational landscape. For more details, visit https://www.bcit.ca.",
    "website": "https://www.bcit.ca"
  },
  {
    "name": "Capilano University",
    "city": "North Vancouver",
    "province": "British Columbia",
    "country": "Canada",
    "students": 8000,
    "founded": 1968,
    "description": "Capilano University is a prominent institution located in North Vancouver, British Columbia. Founded in 1968, the university serves a diverse student body of approximately 8000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, Capilano University plays a key role in British Columbia's educational landscape. For more details, visit https://www.capilanou.ca.",
    "website": "https://www.capilanou.ca"
  },
  {
    "name": "Emily Carr University of Art and Design",
    "city": "Vancouver",
    "province": "British Columbia",
    "country": "Canada",
    "students": 2000,
    "founded": 1925,
    "description": "Emily Carr University of Art and Design is a prominent institution located in Vancouver, British Columbia. Founded in 1925, the university serves a diverse student body of approximately 2000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, Emily Carr University of Art and Design plays a key role in British Columbia's educational landscape. For more details, visit https://www.ecuad.ca.",
    "website": "https://www.ecuad.ca"
  },
  {
    "name": "Kwantlen Polytechnic University",
    "city": "Surrey",
    "province": "British Columbia",
    "country": "Canada",
    "students": 20000,
    "founded": 1981,
    "description": "Kwantlen Polytechnic University is a prominent institution located in Surrey, British Columbia. Founded in 1981, the university serves a diverse student body of approximately 20000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, Kwantlen Polytechnic University plays a key role in British Columbia's educational landscape. For more details, visit https://www.kpu.ca.",
    "website": "https://www.kpu.ca"
  },
  {
    "name": "Nicola Valley Institute of Technology",
    "city": "Merritt",
    "province": "British Columbia",
    "country": "Canada",
    "students": 700,
    "founded": 1983,
    "description": "Nicola Valley Institute of Technology is a prominent institution located in Merritt, British Columbia. Founded in 1983, the university serves a diverse student body of approximately 700 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, Nicola Valley Institute of Technology plays a key role in British Columbia's educational landscape. For more details, visit https://www.nvit.ca.",
    "website": "https://www.nvit.ca"
  },
  {
    "name": "Quest University Canada",
    "city": "Squamish",
    "province": "British Columbia",
    "country": "Canada",
    "students": 600,
    "founded": 2007,
    "description": "Quest University Canada is a prominent institution located in Squamish, British Columbia. Founded in 2007, the university serves a diverse student body of approximately 600 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, Quest University Canada plays a key role in British Columbia's educational landscape. For more details, visit https://www.questu.ca.",
    "website": "https://www.questu.ca"
  },
  {
    "name": "Royal Roads University",
    "city": "Victoria",
    "province": "British Columbia",
    "country": "Canada",
    "students": 5500,
    "founded": 1995,
    "description": "Royal Roads University is a prominent institution located in Victoria, British Columbia. Founded in 1995, the university serves a diverse student body of approximately 5500 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, Royal Roads University plays a key role in British Columbia's educational landscape. For more details, visit https://www.royalroads.ca.",
    "website": "https://www.royalroads.ca"
  },
  {
    "name": "Simon Fraser University",
    "city": "Burnaby",
    "province": "British Columbia",
    "country": "Canada",
    "students": 30000,
    "founded": 1965,
    "description": "Simon Fraser University is a prominent institution located in Burnaby, British Columbia. Founded in 1965, the university serves a diverse student body of approximately 30000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, Simon Fraser University plays a key role in British Columbia's educational landscape. For more details, visit https://www.sfu.ca.",
    "website": "https://www.sfu.ca"
  },
  {
    "name": "The University of British Columbia",
    "city": "Vancouver",
    "province": "British Columbia",
    "country": "Canada",
    "students": 60000,
    "founded": 1908,
    "description": "The University of British Columbia is a prominent institution located in Vancouver, British Columbia. Founded in 1908, the university serves a diverse student body of approximately 60000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, The University of British Columbia plays a key role in British Columbia's educational landscape. For more details, visit https://www.ubc.ca.",
    "website": "https://www.ubc.ca"
  },
  {
    "name": "Thompson Rivers University",
    "city": "Kamloops",
    "province": "British Columbia",
    "country": "Canada",
    "students": 14000,
    "founded": 1970,
    "description": "Thompson Rivers University is a prominent institution located in Kamloops, British Columbia. Founded in 1970, the university serves a diverse student body of approximately 14000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, Thompson Rivers University plays a key role in British Columbia's educational landscape. For more details, visit https://www.tru.ca.",
    "website": "https://www.tru.ca"
  },
  {
    "name": "Trinity Western University",
    "city": "Langley",
    "province": "British Columbia",
    "country": "Canada",
    "students": 4000,
    "founded": 1962,
    "description": "Trinity Western University is a prominent institution located in Langley, British Columbia. Founded in 1962, the university serves a diverse student body of approximately 4000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, Trinity Western University plays a key role in British Columbia's educational landscape. For more details, visit https://www.twu.ca.",
    "website": "https://www.twu.ca"
  },
  {
    "name": "University Canada West",
    "city": "Vancouver",
    "province": "British Columbia",
    "country": "Canada",
    "students": 10000,
    "founded": 2004,
    "description": "University Canada West is a prominent institution located in Vancouver, British Columbia. Founded in 2004, the university serves a diverse student body of approximately 10000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, University Canada West plays a key role in British Columbia's educational landscape. For more details, visit https://www.ucanwest.ca.",
    "website": "https://www.ucanwest.ca"
  },
  {
    "name": "University of Northern British Columbia",
    "city": "Prince George",
    "province": "British Columbia",
    "country": "Canada",
    "students": 3500,
    "founded": 1990,
    "description": "University of Northern British Columbia is a prominent institution located in Prince George, British Columbia. Founded in 1990, the university serves a diverse student body of approximately 3500 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, University of Northern British Columbia plays a key role in British Columbia's educational landscape. For more details, visit https://www.unbc.ca.",
    "website": "https://www.unbc.ca"
  },
  {
    "name": "University of the Fraser Valley",
    "city": "Abbotsford",
    "province": "British Columbia",
    "country": "Canada",
    "students": 15000,
    "founded": 1974,
    "description": "University of the Fraser Valley is a prominent institution located in Abbotsford, British Columbia. Founded in 1974, the university serves a diverse student body of approximately 15000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, University of the Fraser Valley plays a key role in British Columbia's educational landscape. For more details, visit https://www.ufv.ca.",
    "website": "https://www.ufv.ca"
  },
  {
    "name": "University of Victoria",
    "city": "Victoria",
    "province": "British Columbia",
    "country": "Canada",
    "students": 22000,
    "founded": 1963,
    "description": "University of Victoria is a prominent institution located in Victoria, British Columbia. Founded in 1963, the university serves a diverse student body of approximately 22000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, University of Victoria plays a key role in British Columbia's educational landscape. For more details, visit https://www.uvic.ca.",
    "website": "https://www.uvic.ca"
  },
  {
    "name": "Vancouver Island University",
    "city": "Nanaimo",
    "province": "British Columbia",
    "country": "Canada",
    "students": 16000,
    "founded": 1969,
    "description": "Vancouver Island University is a prominent institution located in Nanaimo, British Columbia. Founded in 1969, the university serves a diverse student body of approximately 16000 individuals. It offers a wide range of programs, fostering academic excellence, research, and community engagement. With modern facilities and a commitment to innovation, Vancouver Island University plays a key role in British Columbia's educational landscape. For more details, visit https://www.viu.ca.",
    "website": "https://www.viu.ca"
  }
]